<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"84346104df5c720d3898bd0430ac6477d8ce8b437a65715aeb327ccc1f462193","plan_job_ref":"Job Pull Request Checks #4834 at https://github.com/GSA-TTS/FAC/actions/runs/15632356828","plan_out_hash":"97ac5b0f1c36ec754663ef23531dc7ed54128d0123271ff54483ec419d24d5a7","plan_hash":"bc84afbdc7362f5385a02b64c78d57d40f63f2929d2dd6979d1c8681d42bfb9a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 3 to add, 13 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
            },
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
            },
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873"
            },
        ]
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
        ]
    }

  # module.production.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
!~      policies = [
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
        ]
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = (known after apply)
            },
        ]
    }

  # module.production.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T20:52:46Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-production-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "28f7a0bda5e5ef3edbd3f5a6308c42703bb9d2bff793be4acee0c0dae9887158" -> "cea07b634f9038be3326e23871256811b9bfa56cd12cd424bbf22b8695c5414f"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-30T18:55:47Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.production.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "85f6e332-8ef0-4fa1-bcc4-ba5803231358" -> null
-               app_process_type = "web" -> null
-               id               = "92e80372-ae8a-4f64-86e4-11727a2d766d" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "bac6e24a-a79d-48d6-b96e-05fee20c0539"
!~      updated_at   = "2025-04-21T20:53:39Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996" -> "ghcr.io/gsa-tts/fac/clamav@sha256:10d29d182a906484cd235672fb88fad06c68959eeb315afc50dc4635da3180aa"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-05-30T18:27:00Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-05-30T18:25:13Z" -> (known after apply)
        }
    }

  # module.production.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.production.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T20:53:41Z" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "00ad5f5ebd6a9375c5ee2f56becc6685b67b9840e35a7085d7ab8457f47f7cda" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-30T18:27:55Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.production.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-05-30T18:27:55Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
-               app_process_type = "web" -> null
-               id               = "e76afd49-a5a2-40cd-8b1f-7be0bbed9e52" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-05-30T18:27:55Z" -> (known after apply)
!~      url          = "fac-file-scanner-production.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996" -> "ghcr.io/gsa-tts/fac/clamav@sha256:10d29d182a906484cd235672fb88fad06c68959eeb315afc50dc4635da3180aa"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-05-30T18:28:35Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T20:52:29Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-production-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "3d2b5f8f666c8db20d827f80aab549c465cdc67d52cf32c760a08d9ae371a09d" -> "b484469dcfb5672a2891b928bf55728283205ede65f1c1322f0514d2eecae40b"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-30T18:55:37Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-               app_process_type = "web" -> null
-               id               = "301409a5-a526-4295-a5bc-434d89b7b4c2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "456570fe-c30a-4ed5-a2ef-ab3f768e617a"
!~      updated_at   = "2025-04-21T20:52:46Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-               app_process_type = "web" -> null
-               id               = "68e16414-09a5-4efc-b00a-6ec2344161a2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "5ae55cd7-5641-4974-a489-56a5cf2c7524"
!~      updated_at   = "2025-04-21T20:54:32Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.production.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "ca564d14-b89a-4944-a43f-033dca62ab30"
!~      last_operation    = {
!~          created_at  = "2025-03-14T15:36:40Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T15:36:40Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T15:36:40Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "production"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-05-30T18:28:35Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-               app_process_type = "web" -> null
-               id               = "52adde67-02de-4efc-9aa5-ab7dabff2f98" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "5593dba8-7023-49a5-bdbe-e809fe23edf9" -> (known after apply) # forces replacement
!~      updated_at   = "2025-05-30T18:28:35Z" -> (known after apply)
!~      url          = "fac-av-production-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 13 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4834](https://github.com/GSA-TTS/FAC/actions/runs/15632356828)